OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1789.h
extern __at(0x0EAA) volatile __PSMC1DBFbits_t PSMC1DBFbits;

#define _PSMC1DBF0              0x01
#define _PSMC1DBF1              0x02
#define _PSMC1DBF2              0x04
#define _PSMC1DBF3              0x08
#define _PSMC1DBF4              0x10
#define _PSMC1DBF5              0x20
#define _PSMC1DBF6              0x40
#define _PSMC1DBF7              0x80

//==============================================================================


//==============================================================================
//        PSMC1BLKR Bits

extern __at(0x0EAB) __sfr PSMC1BLKR;

typedef struct
  {
  unsigned PSMC1BLKR0           : 1;
  unsigned PSMC1BLKR1           : 1;
  unsigned PSMC1BLKR2           : 1;
  unsigned PSMC1BLKR3           : 1;
  unsigned PSMC1BLKR4           : 1;
  unsigned PSMC1BLKR5           : 1;
  unsigned PSMC1BLKR6           : 1;
  unsigned PSMC1BLKR7           : 1;
  } __PSMC1BLKRbits_t;

extern __at(0x0EAB) volatile __PSMC1BLKRbits_t PSMC1BLKRbits;

#define _PSMC1BLKR0             0x01
#define _PSMC1BLKR1             0x02
#define _PSMC1BLKR2             0x04
#define _PSMC1BLKR3             0x08
#define _PSMC1BLKR4             0x10
#define _PSMC1BLKR5             0x20
#define _PSMC1BLKR6             0x40
#define _PSMC1BLKR7             0x80

//==============================================================================


//==============================================================================
//        PSMC1BLKF Bits

extern __at(0x0EAC) __sfr PSMC1BLKF;

typedef struct
  {
  unsigned PSMC1BLKF0           : 1;
  unsigned PSMC1BLKF1           : 1;
  unsigned PSMC1BLKF2           : 1;
  unsigned PSMC1BLKF3           : 1;
  unsigned PSMC1BLKF4           : 1;
  unsigned PSMC1BLKF5           : 1;
  unsigned PSMC1BLKF6           : 1;
  unsigned PSMC1BLKF7           : 1;
  } __PSMC1BLKFbits_t;

extern __at(0x0EAC) volatile __PSMC1BLKFbits_t PSMC1BLKFbits;

#define _PSMC1BLKF0             0x01
#define _PSMC1BLKF1             0x02
#define _PSMC1BLKF2             0x04
#define _PSMC1BLKF3             0x08
#define _PSMC1BLKF4             0x10
#define _PSMC1BLKF5             0x20
#define _PSMC1BLKF6             0x40
#define _PSMC1BLKF7             0x80

//==============================================================================


//==============================================================================
//        PSMC1FFA Bits

extern __at(0x0EAD) __sfr PSMC1FFA;

typedef union
  {
  struct
    {
    unsigned PSMC1FFA0          : 1;
    unsigned PSMC1FFA1          : 1;
    unsigned PSMC1FFA2          : 1;
    unsigned PSMC1FFA3          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PSMC1FFA           : 4;
    unsigned                    : 4;
    };
  } __PSMC1FFAbits_t;

extern __at(0x0EAD) volatile __PSMC1FFAbits_t PSMC1FFAbits;

#define _PSMC1FFA0              0x01
#define _PSMC1FFA1              0x02
#define _PSMC1FFA2              0x04
#define _PSMC1FFA3              0x08

//==============================================================================


//==============================================================================
//        PSMC1STR0 Bits

extern __at(0x0EAE) __sfr PSMC1STR0;

typedef struct
  {
  unsigned P1STRA               : 1;
  unsigned P1STRB               : 1;
  unsigned P1STRC               : 1;
  unsigned P1STRD               : 1;
  unsigned P1STRE               : 1;
  unsigned P1STRF               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC1STR0bits_t;

extern __at(0x0EAE) volatile __PSMC1STR0bits_t PSMC1STR0bits;

#define _P1STRA                 0x01
#define _P1STRB                 0x02
#define _P1STRC                 0x04
#define _P1STRD                 0x08
#define _P1STRE                 0x10
#define _P1STRF                 0x20

//==============================================================================


//==============================================================================
//        PSMC1STR1 Bits

extern __at(0x0EAF) __sfr PSMC1STR1;

typedef struct
  {
  unsigned P1HSMEN              : 1;
  unsigned P1LSMEN              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P1SSYNC              : 1;
  } __PSMC1STR1bits_t;

extern __at(0x0EAF) volatile __PSMC1STR1bits_t PSMC1STR1bits;

#define _P1HSMEN                0x01
#define _P1LSMEN                0x02
#define _P1SSYNC                0x80

//==============================================================================


//==============================================================================
//        PSMC2CON Bits

extern __at(0x0EB1) __sfr PSMC2CON;

typedef union
  {
  struct
    {
    unsigned P2MODE0            : 1;
    unsigned P2MODE1            : 1;
    unsigned P2MODE2            : 1;
    unsigned P2MODE3            : 1;
    unsigned P2DBRE             : 1;
    unsigned P2DBFE             : 1;
    unsigned PSMC2LD            : 1;
    unsigned PSMC2EN            : 1;
    };

  struct
    {
    unsigned P2MODE             : 4;
    unsigned                    : 4;
    };
  } __PSMC2CONbits_t;

extern __at(0x0EB1) volatile __PSMC2CONbits_t PSMC2CONbits;

#define _P2MODE0                0x01
#define _P2MODE1                0x02
#define _P2MODE2                0x04
#define _P2MODE3                0x08
#define _P2DBRE                 0x10
#define _P2DBFE                 0x20
#define _PSMC2LD                0x40
#define _PSMC2EN                0x80

//==============================================================================


//==============================================================================
//        PSMC2MDL Bits

extern __at(0x0EB2) __sfr PSMC2MDL;

typedef union
  {
  struct
    {
    unsigned P2MSRC0            : 1;
    unsigned P2MSRC1            : 1;
    unsigned P2MSRC2            : 1;
    unsigned P2MSRC3            : 1;
    unsigned                    : 1;
    unsigned P2MDLBIT           : 1;
    unsigned P2MDLPOL           : 1;
    unsigned P2MDLEN            : 1;
    };

  struct
    {
    unsigned P2MSRC             : 4;
    unsigned                    : 4;
    };
  } __PSMC2MDLbits_t;

extern __at(0x0EB2) volatile __PSMC2MDLbits_t PSMC2MDLbits;

#define _P2MSRC0                0x01
#define _P2MSRC1                0x02
#define _P2MSRC2                0x04
#define _P2MSRC3                0x08
#define _P2MDLBIT               0x20
#define _P2MDLPOL               0x40
#define _P2MDLEN                0x80

//==============================================================================


//==============================================================================
//        PSMC2SYNC Bits

extern __at(0x0EB3) __sfr PSMC2SYNC;

typedef union
  {
  struct
    {
    unsigned P2SYNC0            : 1;
    unsigned P2SYNC1            : 1;
    unsigned P2SYNC2            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P2DCPOL            : 1;
    unsigned P2PRPOL            : 1;
    unsigned P2POFST            : 1;
    };

  struct
    {
    unsigned P2SYNC             : 3;
    unsigned                    : 5;
    };
  } __PSMC2SYNCbits_t;

extern __at(0x0EB3) volatile __PSMC2SYNCbits_t PSMC2SYNCbits;

#define _P2SYNC0                0x01
#define _P2SYNC1                0x02
#define _P2SYNC2                0x04
#define _P2DCPOL                0x20
#define _P2PRPOL                0x40
#define _P2POFST                0x80

//==============================================================================


//==============================================================================
//        PSMC2CLK Bits

extern __at(0x0EB4) __sfr PSMC2CLK;

typedef union
  {
  struct
    {
    unsigned P2CSRC0            : 1;
    unsigned P2CSRC1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P2CPRE0            : 1;
    unsigned P2CPRE1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P2CSRC             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P2CPRE             : 2;
    unsigned                    : 2;
    };
  } __PSMC2CLKbits_t;

