OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1789.h
#define _P2PRST                 0x01
#define _P2PRSC1                0x02
#define _P2PRSC2                0x04
#define _P2PRSC3                0x08
#define _P2PRSC4                0x10
#define _P2PRSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC2ASDC Bits

extern __at(0x0EBD) __sfr PSMC2ASDC;

typedef struct
  {
  unsigned P2ASDOV              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2ARSEN              : 1;
  unsigned P2ASDEN              : 1;
  unsigned P2ASE                : 1;
  } __PSMC2ASDCbits_t;

extern __at(0x0EBD) volatile __PSMC2ASDCbits_t PSMC2ASDCbits;

#define _P2ASDOV                0x01
#define _P2ARSEN                0x20
#define _P2ASDEN                0x40
#define _P2ASE                  0x80

//==============================================================================


//==============================================================================
//        PSMC2ASDL Bits

extern __at(0x0EBE) __sfr PSMC2ASDL;

typedef struct
  {
  unsigned P2ASDLA              : 1;
  unsigned P2ASDLB              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC2ASDLbits_t;

extern __at(0x0EBE) volatile __PSMC2ASDLbits_t PSMC2ASDLbits;

#define _P2ASDLA                0x01
#define _P2ASDLB                0x02

//==============================================================================


//==============================================================================
//        PSMC2ASDS Bits

extern __at(0x0EBF) __sfr PSMC2ASDS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P2ASDSC1             : 1;
  unsigned P2ASDSC2             : 1;
  unsigned P2ASDSC3             : 1;
  unsigned P2ASDSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2ASDSIN             : 1;
  } __PSMC2ASDSbits_t;

extern __at(0x0EBF) volatile __PSMC2ASDSbits_t PSMC2ASDSbits;

#define _P2ASDSC1               0x02
#define _P2ASDSC2               0x04
#define _P2ASDSC3               0x08
#define _P2ASDSC4               0x10
#define _P2ASDSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC2INT Bits

extern __at(0x0EC0) __sfr PSMC2INT;

typedef struct
  {
  unsigned P2TPRIF              : 1;
  unsigned P2TDCIF              : 1;
  unsigned P2TPHIF              : 1;
  unsigned P2TOVIF              : 1;
  unsigned P2TPRIE              : 1;
  unsigned P2TDCIE              : 1;
  unsigned P2TPHIE              : 1;
  unsigned P2TOVIE              : 1;
  } __PSMC2INTbits_t;

extern __at(0x0EC0) volatile __PSMC2INTbits_t PSMC2INTbits;

#define _P2TPRIF                0x01
#define _P2TDCIF                0x02
#define _P2TPHIF                0x04
#define _P2TOVIF                0x08
#define _P2TPRIE                0x10
#define _P2TDCIE                0x20
#define _P2TPHIE                0x40
#define _P2TOVIE                0x80

//==============================================================================

extern __at(0x0EC1) __sfr PSMC2PH;

//==============================================================================
//        PSMC2PHL Bits

extern __at(0x0EC1) __sfr PSMC2PHL;

typedef struct
  {
  unsigned PSMC2PH0             : 1;
  unsigned PSMC2PH1             : 1;
  unsigned PSMC2PH2             : 1;
  unsigned PSMC2PH3             : 1;
  unsigned PSMC2PH4             : 1;
  unsigned PSMC2PH5             : 1;
  unsigned PSMC2PH6             : 1;
  unsigned PSMC2PH7             : 1;
  } __PSMC2PHLbits_t;

extern __at(0x0EC1) volatile __PSMC2PHLbits_t PSMC2PHLbits;

#define _PSMC2PH0               0x01
#define _PSMC2PH1               0x02
#define _PSMC2PH2               0x04
#define _PSMC2PH3               0x08
#define _PSMC2PH4               0x10
#define _PSMC2PH5               0x20
#define _PSMC2PH6               0x40
#define _PSMC2PH7               0x80

//==============================================================================


//==============================================================================
//        PSMC2PHH Bits

extern __at(0x0EC2) __sfr PSMC2PHH;

typedef struct
  {
  unsigned PSMC2PH8             : 1;
  unsigned PSMC2PH9             : 1;
  unsigned PSMC2PH10            : 1;
  unsigned PSMC2PH11            : 1;
  unsigned PSMC2PH12            : 1;
  unsigned PSMC2PH13            : 1;
  unsigned PSMC2PH14            : 1;
  unsigned PSMC2PH15            : 1;
  } __PSMC2PHHbits_t;

extern __at(0x0EC2) volatile __PSMC2PHHbits_t PSMC2PHHbits;

#define _PSMC2PH8               0x01
#define _PSMC2PH9               0x02
#define _PSMC2PH10              0x04
#define _PSMC2PH11              0x08
#define _PSMC2PH12              0x10
#define _PSMC2PH13              0x20
#define _PSMC2PH14              0x40
#define _PSMC2PH15              0x80

//==============================================================================

extern __at(0x0EC3) __sfr PSMC2DC;

//==============================================================================
//        PSMC2DCL Bits

extern __at(0x0EC3) __sfr PSMC2DCL;

typedef struct
  {
  unsigned PSMC2DC0             : 1;
  unsigned PSMC2DC1             : 1;
  unsigned PSMC2DC2             : 1;
  unsigned PSMC2DC3             : 1;
  unsigned PSMC2DC4             : 1;
  unsigned PSMC2DC5             : 1;
  unsigned PSMC2DC6             : 1;
  unsigned PSMC2DC7             : 1;
  } __PSMC2DCLbits_t;

extern __at(0x0EC3) volatile __PSMC2DCLbits_t PSMC2DCLbits;

#define _PSMC2DC0               0x01
#define _PSMC2DC1               0x02
#define _PSMC2DC2               0x04
#define _PSMC2DC3               0x08
#define _PSMC2DC4               0x10
#define _PSMC2DC5               0x20
#define _PSMC2DC6               0x40
#define _PSMC2DC7               0x80

//==============================================================================


//==============================================================================
//        PSMC2DCH Bits

