OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1789.h
extern __at(0x0F24) __sfr PSMC4DCH;

typedef struct
  {
  unsigned PSMC4DC8             : 1;
  unsigned PSMC4DC9             : 1;
  unsigned PSMC4DC10            : 1;
  unsigned PSMC4DC11            : 1;
  unsigned PSMC4DC12            : 1;
  unsigned PSMC4DC13            : 1;
  unsigned PSMC4DC14            : 1;
  unsigned PSMC4DC15            : 1;
  } __PSMC4DCHbits_t;

extern __at(0x0F24) volatile __PSMC4DCHbits_t PSMC4DCHbits;

#define _PSMC4DC8               0x01
#define _PSMC4DC9               0x02
#define _PSMC4DC10              0x04
#define _PSMC4DC11              0x08
#define _PSMC4DC12              0x10
#define _PSMC4DC13              0x20
#define _PSMC4DC14              0x40
#define _PSMC4DC15              0x80

//==============================================================================

extern __at(0x0F25) __sfr PSMC4PR;

//==============================================================================
//        PSMC4PRL Bits

extern __at(0x0F25) __sfr PSMC4PRL;

typedef struct
  {
  unsigned PSMC4PR0             : 1;
  unsigned PSMC4PR1             : 1;
  unsigned PSMC4PR2             : 1;
  unsigned PSMC4PR3             : 1;
  unsigned PSMC4PR4             : 1;
  unsigned PSMC4PR5             : 1;
  unsigned PSMC4PR6             : 1;
  unsigned PSMC4PR7             : 1;
  } __PSMC4PRLbits_t;

extern __at(0x0F25) volatile __PSMC4PRLbits_t PSMC4PRLbits;

#define _PSMC4PR0               0x01
#define _PSMC4PR1               0x02
#define _PSMC4PR2               0x04
#define _PSMC4PR3               0x08
#define _PSMC4PR4               0x10
#define _PSMC4PR5               0x20
#define _PSMC4PR6               0x40
#define _PSMC4PR7               0x80

//==============================================================================


//==============================================================================
//        PSMC4PRH Bits

extern __at(0x0F26) __sfr PSMC4PRH;

typedef struct
  {
  unsigned PSMC4PR8             : 1;
  unsigned PSMC4PR9             : 1;
  unsigned PSMC4PR10            : 1;
  unsigned PSMC4PR11            : 1;
  unsigned PSMC4PR12            : 1;
  unsigned PSMC4PR13            : 1;
  unsigned PSMC4PR14            : 1;
  unsigned PSMC4PR15            : 1;
  } __PSMC4PRHbits_t;

extern __at(0x0F26) volatile __PSMC4PRHbits_t PSMC4PRHbits;

#define _PSMC4PR8               0x01
#define _PSMC4PR9               0x02
#define _PSMC4PR10              0x04
#define _PSMC4PR11              0x08
#define _PSMC4PR12              0x10
#define _PSMC4PR13              0x20
#define _PSMC4PR14              0x40
#define _PSMC4PR15              0x80

//==============================================================================

extern __at(0x0F27) __sfr PSMC4TMR;

//==============================================================================
//        PSMC4TMRL Bits

extern __at(0x0F27) __sfr PSMC4TMRL;

typedef struct
  {
  unsigned PSMC4TMR0            : 1;
  unsigned PSMC4TMR1            : 1;
  unsigned PSMC4TMR2            : 1;
  unsigned PSMC4TMR3            : 1;
  unsigned PSMC4TMR4            : 1;
  unsigned PSMC4TMR5            : 1;
  unsigned PSMC4TMR6            : 1;
  unsigned PSMC4TMR7            : 1;
  } __PSMC4TMRLbits_t;

extern __at(0x0F27) volatile __PSMC4TMRLbits_t PSMC4TMRLbits;

#define _PSMC4TMR0              0x01
#define _PSMC4TMR1              0x02
#define _PSMC4TMR2              0x04
#define _PSMC4TMR3              0x08
#define _PSMC4TMR4              0x10
#define _PSMC4TMR5              0x20
#define _PSMC4TMR6              0x40
#define _PSMC4TMR7              0x80

//==============================================================================


//==============================================================================
//        PSMC4TMRH Bits

extern __at(0x0F28) __sfr PSMC4TMRH;

typedef struct
  {
  unsigned PSMC4TMR8            : 1;
  unsigned PSMC4TMR9            : 1;
  unsigned PSMC4TMR10           : 1;
  unsigned PSMC4TMR11           : 1;
  unsigned PSMC4TMR12           : 1;
  unsigned PSMC4TMR13           : 1;
  unsigned PSMC4TMR14           : 1;
  unsigned PSMC4TMR15           : 1;
  } __PSMC4TMRHbits_t;

extern __at(0x0F28) volatile __PSMC4TMRHbits_t PSMC4TMRHbits;

#define _PSMC4TMR8              0x01
#define _PSMC4TMR9              0x02
#define _PSMC4TMR10             0x04
#define _PSMC4TMR11             0x08
#define _PSMC4TMR12             0x10
#define _PSMC4TMR13             0x20
#define _PSMC4TMR14             0x40
#define _PSMC4TMR15             0x80

//==============================================================================


//==============================================================================
//        PSMC4DBR Bits

extern __at(0x0F29) __sfr PSMC4DBR;

typedef struct
  {
  unsigned PSMC4DBR0            : 1;
  unsigned PSMC4DBR1            : 1;
  unsigned PSMC4DBR2            : 1;
  unsigned PSMC4DBR3            : 1;
  unsigned PSMC4DBR4            : 1;
  unsigned PSMC4DBR5            : 1;
  unsigned PSMC4DBR6            : 1;
  unsigned PSMC4DBR7            : 1;
  } __PSMC4DBRbits_t;

extern __at(0x0F29) volatile __PSMC4DBRbits_t PSMC4DBRbits;

#define _PSMC4DBR0              0x01
#define _PSMC4DBR1              0x02
#define _PSMC4DBR2              0x04
#define _PSMC4DBR3              0x08
#define _PSMC4DBR4              0x10
#define _PSMC4DBR5              0x20
#define _PSMC4DBR6              0x40
#define _PSMC4DBR7              0x80

//==============================================================================


//==============================================================================
//        PSMC4DBF Bits

extern __at(0x0F2A) __sfr PSMC4DBF;

typedef struct
  {
  unsigned PSMC4DBF0            : 1;
  unsigned PSMC4DBF1            : 1;
  unsigned PSMC4DBF2            : 1;
  unsigned PSMC4DBF3            : 1;
  unsigned PSMC4DBF4            : 1;
  unsigned PSMC4DBF5            : 1;
  unsigned PSMC4DBF6            : 1;
  unsigned PSMC4DBF7            : 1;
  } __PSMC4DBFbits_t;

extern __at(0x0F2A) volatile __PSMC4DBFbits_t PSMC4DBFbits;

#define _PSMC4DBF0              0x01
#define _PSMC4DBF1              0x02
#define _PSMC4DBF2              0x04
#define _PSMC4DBF3              0x08
#define _PSMC4DBF4              0x10
#define _PSMC4DBF5              0x20
#define _PSMC4DBF6              0x40
#define _PSMC4DBF7              0x80

//==============================================================================


//==============================================================================
//        PSMC4BLKR Bits

extern __at(0x0F2B) __sfr PSMC4BLKR;

typedef struct
  {
  unsigned PSMC4BLKR0           : 1;
  unsigned PSMC4BLKR1           : 1;
  unsigned PSMC4BLKR2           : 1;
  unsigned PSMC4BLKR3           : 1;
  unsigned PSMC4BLKR4           : 1;
  unsigned PSMC4BLKR5           : 1;
  unsigned PSMC4BLKR6           : 1;
  unsigned PSMC4BLKR7           : 1;
  } __PSMC4BLKRbits_t;

extern __at(0x0F2B) volatile __PSMC4BLKRbits_t PSMC4BLKRbits;

#define _PSMC4BLKR0             0x01
#define _PSMC4BLKR1             0x02
#define _PSMC4BLKR2             0x04
#define _PSMC4BLKR3             0x08
#define _PSMC4BLKR4             0x10
#define _PSMC4BLKR5             0x20
#define _PSMC4BLKR6             0x40
#define _PSMC4BLKR7             0x80

//==============================================================================


//==============================================================================
//        PSMC4BLKF Bits

extern __at(0x0F2C) __sfr PSMC4BLKF;

typedef struct
  {
  unsigned PSMC4BLKF0           : 1;
  unsigned PSMC4BLKF1           : 1;
  unsigned PSMC4BLKF2           : 1;
  unsigned PSMC4BLKF3           : 1;
  unsigned PSMC4BLKF4           : 1;
  unsigned PSMC4BLKF5           : 1;
  unsigned PSMC4BLKF6           : 1;
  unsigned PSMC4BLKF7           : 1;
  } __PSMC4BLKFbits_t;

extern __at(0x0F2C) volatile __PSMC4BLKFbits_t PSMC4BLKFbits;

#define _PSMC4BLKF0             0x01
#define _PSMC4BLKF1             0x02
#define _PSMC4BLKF2             0x04
#define _PSMC4BLKF3             0x08
#define _PSMC4BLKF4             0x10
#define _PSMC4BLKF5             0x20
#define _PSMC4BLKF6             0x40
#define _PSMC4BLKF7             0x80

//==============================================================================


//==============================================================================
//        PSMC4FFA Bits

extern __at(0x0F2D) __sfr PSMC4FFA;

typedef union
  {
  struct
    {
    unsigned PSMC4FFA0          : 1;
    unsigned PSMC4FFA1          : 1;
    unsigned PSMC4FFA2          : 1;
    unsigned PSMC4FFA3          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PSMC4FFA           : 4;
    unsigned                    : 4;
    };
  } __PSMC4FFAbits_t;

extern __at(0x0F2D) volatile __PSMC4FFAbits_t PSMC4FFAbits;

#define _PSMC4FFA0              0x01
#define _PSMC4FFA1              0x02
#define _PSMC4FFA2              0x04
#define _PSMC4FFA3              0x08

//==============================================================================


//==============================================================================
//        PSMC4STR0 Bits

