OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1789.h
#define P1ASDOV                 PSMC1ASDCbits.P1ASDOV           // bit 0
#define P1ARSEN                 PSMC1ASDCbits.P1ARSEN           // bit 5
#define P1ASDEN                 PSMC1ASDCbits.P1ASDEN           // bit 6
#define P1ASE                   PSMC1ASDCbits.P1ASE             // bit 7

#define P1ASDLA                 PSMC1ASDLbits.P1ASDLA           // bit 0
#define P1ASDLB                 PSMC1ASDLbits.P1ASDLB           // bit 1
#define P1ASDLC                 PSMC1ASDLbits.P1ASDLC           // bit 2
#define P1ASDLD                 PSMC1ASDLbits.P1ASDLD           // bit 3
#define P1ASDLE                 PSMC1ASDLbits.P1ASDLE           // bit 4
#define P1ASDLF                 PSMC1ASDLbits.P1ASDLF           // bit 5

#define P1ASDSC1                PSMC1ASDSbits.P1ASDSC1          // bit 1
#define P1ASDSC2                PSMC1ASDSbits.P1ASDSC2          // bit 2
#define P1ASDSC3                PSMC1ASDSbits.P1ASDSC3          // bit 3
#define P1ASDSC4                PSMC1ASDSbits.P1ASDSC4          // bit 4
#define P1ASDSIN                PSMC1ASDSbits.P1ASDSIN          // bit 7

#define PSMC1BLKF0              PSMC1BLKFbits.PSMC1BLKF0        // bit 0
#define PSMC1BLKF1              PSMC1BLKFbits.PSMC1BLKF1        // bit 1
#define PSMC1BLKF2              PSMC1BLKFbits.PSMC1BLKF2        // bit 2
#define PSMC1BLKF3              PSMC1BLKFbits.PSMC1BLKF3        // bit 3
#define PSMC1BLKF4              PSMC1BLKFbits.PSMC1BLKF4        // bit 4
#define PSMC1BLKF5              PSMC1BLKFbits.PSMC1BLKF5        // bit 5
#define PSMC1BLKF6              PSMC1BLKFbits.PSMC1BLKF6        // bit 6
#define PSMC1BLKF7              PSMC1BLKFbits.PSMC1BLKF7        // bit 7

#define PSMC1BLKR0              PSMC1BLKRbits.PSMC1BLKR0        // bit 0
#define PSMC1BLKR1              PSMC1BLKRbits.PSMC1BLKR1        // bit 1
#define PSMC1BLKR2              PSMC1BLKRbits.PSMC1BLKR2        // bit 2
#define PSMC1BLKR3              PSMC1BLKRbits.PSMC1BLKR3        // bit 3
#define PSMC1BLKR4              PSMC1BLKRbits.PSMC1BLKR4        // bit 4
#define PSMC1BLKR5              PSMC1BLKRbits.PSMC1BLKR5        // bit 5
#define PSMC1BLKR6              PSMC1BLKRbits.PSMC1BLKR6        // bit 6
#define PSMC1BLKR7              PSMC1BLKRbits.PSMC1BLKR7        // bit 7

#define P1REBM0                 PSMC1BLNKbits.P1REBM0           // bit 0
#define P1REBM1                 PSMC1BLNKbits.P1REBM1           // bit 1
#define P1FEBM0                 PSMC1BLNKbits.P1FEBM0           // bit 4
#define P1FEBM1                 PSMC1BLNKbits.P1FEBM1           // bit 5

#define P1CSRC0                 PSMC1CLKbits.P1CSRC0            // bit 0
#define P1CSRC1                 PSMC1CLKbits.P1CSRC1            // bit 1
#define P1CPRE0                 PSMC1CLKbits.P1CPRE0            // bit 4
#define P1CPRE1                 PSMC1CLKbits.P1CPRE1            // bit 5

#define P1MODE0                 PSMC1CONbits.P1MODE0            // bit 0
#define P1MODE1                 PSMC1CONbits.P1MODE1            // bit 1
#define P1MODE2                 PSMC1CONbits.P1MODE2            // bit 2
#define P1MODE3                 PSMC1CONbits.P1MODE3            // bit 3
#define P1DBRE                  PSMC1CONbits.P1DBRE             // bit 4
#define P1DBFE                  PSMC1CONbits.P1DBFE             // bit 5
#define PSMC1LD                 PSMC1CONbits.PSMC1LD            // bit 6
#define PSMC1EN                 PSMC1CONbits.PSMC1EN            // bit 7

#define PSMC1DBF0               PSMC1DBFbits.PSMC1DBF0          // bit 0
#define PSMC1DBF1               PSMC1DBFbits.PSMC1DBF1          // bit 1
#define PSMC1DBF2               PSMC1DBFbits.PSMC1DBF2          // bit 2
#define PSMC1DBF3               PSMC1DBFbits.PSMC1DBF3          // bit 3
#define PSMC1DBF4               PSMC1DBFbits.PSMC1DBF4          // bit 4
#define PSMC1DBF5               PSMC1DBFbits.PSMC1DBF5          // bit 5
#define PSMC1DBF6               PSMC1DBFbits.PSMC1DBF6          // bit 6
#define PSMC1DBF7               PSMC1DBFbits.PSMC1DBF7          // bit 7

#define PSMC1DBR0               PSMC1DBRbits.PSMC1DBR0          // bit 0
#define PSMC1DBR1               PSMC1DBRbits.PSMC1DBR1          // bit 1
#define PSMC1DBR2               PSMC1DBRbits.PSMC1DBR2          // bit 2
#define PSMC1DBR3               PSMC1DBRbits.PSMC1DBR3          // bit 3
#define PSMC1DBR4               PSMC1DBRbits.PSMC1DBR4          // bit 4
#define PSMC1DBR5               PSMC1DBRbits.PSMC1DBR5          // bit 5
#define PSMC1DBR6               PSMC1DBRbits.PSMC1DBR6          // bit 6
#define PSMC1DBR7               PSMC1DBRbits.PSMC1DBR7          // bit 7

#define PSMC1DC8                PSMC1DCHbits.PSMC1DC8           // bit 0
#define PSMC1DC9                PSMC1DCHbits.PSMC1DC9           // bit 1
#define PSMC1DC10               PSMC1DCHbits.PSMC1DC10          // bit 2
#define PSMC1DC11               PSMC1DCHbits.PSMC1DC11          // bit 3
#define PSMC1DC12               PSMC1DCHbits.PSMC1DC12          // bit 4
#define PSMC1DC13               PSMC1DCHbits.PSMC1DC13          // bit 5
#define PSMC1DC14               PSMC1DCHbits.PSMC1DC14          // bit 6
#define PSMC1DC15               PSMC1DCHbits.PSMC1DC15          // bit 7

#define PSMC1DC0                PSMC1DCLbits.PSMC1DC0           // bit 0
#define PSMC1DC1                PSMC1DCLbits.PSMC1DC1           // bit 1
#define PSMC1DC2                PSMC1DCLbits.PSMC1DC2           // bit 2
#define PSMC1DC3                PSMC1DCLbits.PSMC1DC3           // bit 3
#define PSMC1DC4                PSMC1DCLbits.PSMC1DC4           // bit 4
#define PSMC1DC5                PSMC1DCLbits.PSMC1DC5           // bit 5
#define PSMC1DC6                PSMC1DCLbits.PSMC1DC6           // bit 6
#define PSMC1DC7                PSMC1DCLbits.PSMC1DC7           // bit 7

#define P1DCST                  PSMC1DCSbits.P1DCST             // bit 0
#define P1DCSC1                 PSMC1DCSbits.P1DCSC1            // bit 1
#define P1DCSC2                 PSMC1DCSbits.P1DCSC2            // bit 2
#define P1DCSC3                 PSMC1DCSbits.P1DCSC3            // bit 3
#define P1DCSC4                 PSMC1DCSbits.P1DCSC4            // bit 4
#define P1DCSIN                 PSMC1DCSbits.P1DCSIN            // bit 7

#define P1FEBSC1                PSMC1FEBSbits.P1FEBSC1          // bit 1
#define P1FEBSC2                PSMC1FEBSbits.P1FEBSC2          // bit 2
#define P1FEBSC3                PSMC1FEBSbits.P1FEBSC3          // bit 3
#define P1FEBSC4                PSMC1FEBSbits.P1FEBSC4          // bit 4
#define P1FEBSIN                PSMC1FEBSbits.P1FEBSIN          // bit 7

#define PSMC1FFA0               PSMC1FFAbits.PSMC1FFA0          // bit 0
#define PSMC1FFA1               PSMC1FFAbits.PSMC1FFA1          // bit 1
#define PSMC1FFA2               PSMC1FFAbits.PSMC1FFA2          // bit 2
#define PSMC1FFA3               PSMC1FFAbits.PSMC1FFA3          // bit 3

