OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1789.h
#define P1TPRIF                 PSMC1INTbits.P1TPRIF            // bit 0
#define P1TDCIF                 PSMC1INTbits.P1TDCIF            // bit 1
#define P1TPHIF                 PSMC1INTbits.P1TPHIF            // bit 2
#define P1TOVIF                 PSMC1INTbits.P1TOVIF            // bit 3
#define P1TPRIE                 PSMC1INTbits.P1TPRIE            // bit 4
#define P1TDCIE                 PSMC1INTbits.P1TDCIE            // bit 5
#define P1TPHIE                 PSMC1INTbits.P1TPHIE            // bit 6
#define P1TOVIE                 PSMC1INTbits.P1TOVIE            // bit 7

#define P1MSRC0                 PSMC1MDLbits.P1MSRC0            // bit 0
#define P1MSRC1                 PSMC1MDLbits.P1MSRC1            // bit 1
#define P1MSRC2                 PSMC1MDLbits.P1MSRC2            // bit 2
#define P1MSRC3                 PSMC1MDLbits.P1MSRC3            // bit 3
#define P1MDLBIT                PSMC1MDLbits.P1MDLBIT           // bit 5
#define P1MDLPOL                PSMC1MDLbits.P1MDLPOL           // bit 6
#define P1MDLEN                 PSMC1MDLbits.P1MDLEN            // bit 7

#define P1OEA                   PSMC1OENbits.P1OEA              // bit 0
#define P1OEB                   PSMC1OENbits.P1OEB              // bit 1
#define P1OEC                   PSMC1OENbits.P1OEC              // bit 2
#define P1OED                   PSMC1OENbits.P1OED              // bit 3
#define P1OEE                   PSMC1OENbits.P1OEE              // bit 4
#define P1OEF                   PSMC1OENbits.P1OEF              // bit 5

#define PSMC1PH8                PSMC1PHHbits.PSMC1PH8           // bit 0
#define PSMC1PH9                PSMC1PHHbits.PSMC1PH9           // bit 1
#define PSMC1PH10               PSMC1PHHbits.PSMC1PH10          // bit 2
#define PSMC1PH11               PSMC1PHHbits.PSMC1PH11          // bit 3
#define PSMC1PH12               PSMC1PHHbits.PSMC1PH12          // bit 4
#define PSMC1PH13               PSMC1PHHbits.PSMC1PH13          // bit 5
#define PSMC1PH14               PSMC1PHHbits.PSMC1PH14          // bit 6
#define PSMC1PH15               PSMC1PHHbits.PSMC1PH15          // bit 7

#define PSMC1PH0                PSMC1PHLbits.PSMC1PH0           // bit 0
#define PSMC1PH1                PSMC1PHLbits.PSMC1PH1           // bit 1
#define PSMC1PH2                PSMC1PHLbits.PSMC1PH2           // bit 2
#define PSMC1PH3                PSMC1PHLbits.PSMC1PH3           // bit 3
#define PSMC1PH4                PSMC1PHLbits.PSMC1PH4           // bit 4
#define PSMC1PH5                PSMC1PHLbits.PSMC1PH5           // bit 5
#define PSMC1PH6                PSMC1PHLbits.PSMC1PH6           // bit 6
#define PSMC1PH7                PSMC1PHLbits.PSMC1PH7           // bit 7

#define P1PHST                  PSMC1PHSbits.P1PHST             // bit 0
#define P1PHSC1                 PSMC1PHSbits.P1PHSC1            // bit 1
#define P1PHSC2                 PSMC1PHSbits.P1PHSC2            // bit 2
#define P1PHSC3                 PSMC1PHSbits.P1PHSC3            // bit 3
#define P1PHSC4                 PSMC1PHSbits.P1PHSC4            // bit 4
#define P1PHSIN                 PSMC1PHSbits.P1PHSIN            // bit 7

#define P1POLA                  PSMC1POLbits.P1POLA             // bit 0
#define P1POLB                  PSMC1POLbits.P1POLB             // bit 1
#define P1POLC                  PSMC1POLbits.P1POLC             // bit 2
#define P1POLD                  PSMC1POLbits.P1POLD             // bit 3
#define P1POLE                  PSMC1POLbits.P1POLE             // bit 4
#define P1POLF                  PSMC1POLbits.P1POLF             // bit 5
#define P1INPOL                 PSMC1POLbits.P1INPOL            // bit 6

#define PSMC1PR8                PSMC1PRHbits.PSMC1PR8           // bit 0
#define PSMC1PR9                PSMC1PRHbits.PSMC1PR9           // bit 1
#define PSMC1PR10               PSMC1PRHbits.PSMC1PR10          // bit 2
#define PSMC1PR11               PSMC1PRHbits.PSMC1PR11          // bit 3
#define PSMC1PR12               PSMC1PRHbits.PSMC1PR12          // bit 4
#define PSMC1PR13               PSMC1PRHbits.PSMC1PR13          // bit 5
#define PSMC1PR14               PSMC1PRHbits.PSMC1PR14          // bit 6
#define PSMC1PR15               PSMC1PRHbits.PSMC1PR15          // bit 7

#define PSMC1PR0                PSMC1PRLbits.PSMC1PR0           // bit 0
#define PSMC1PR1                PSMC1PRLbits.PSMC1PR1           // bit 1
#define PSMC1PR2                PSMC1PRLbits.PSMC1PR2           // bit 2
#define PSMC1PR3                PSMC1PRLbits.PSMC1PR3           // bit 3
#define PSMC1PR4                PSMC1PRLbits.PSMC1PR4           // bit 4
#define PSMC1PR5                PSMC1PRLbits.PSMC1PR5           // bit 5
#define PSMC1PR6                PSMC1PRLbits.PSMC1PR6           // bit 6
#define PSMC1PR7                PSMC1PRLbits.PSMC1PR7           // bit 7

#define P1PRST                  PSMC1PRSbits.P1PRST             // bit 0
#define P1PRSC1                 PSMC1PRSbits.P1PRSC1            // bit 1
#define P1PRSC2                 PSMC1PRSbits.P1PRSC2            // bit 2
#define P1PRSC3                 PSMC1PRSbits.P1PRSC3            // bit 3
#define P1PRSC4                 PSMC1PRSbits.P1PRSC4            // bit 4
#define P1PRSIN                 PSMC1PRSbits.P1PRSIN            // bit 7

#define P1REBSC1                PSMC1REBSbits.P1REBSC1          // bit 1
#define P1REBSC2                PSMC1REBSbits.P1REBSC2          // bit 2
#define P1REBSC3                PSMC1REBSbits.P1REBSC3          // bit 3
#define P1REBSC4                PSMC1REBSbits.P1REBSC4          // bit 4
#define P1REBSIN                PSMC1REBSbits.P1REBSIN          // bit 7

#define P1STRA                  PSMC1STR0bits.P1STRA            // bit 0
#define P1STRB                  PSMC1STR0bits.P1STRB            // bit 1
#define P1STRC                  PSMC1STR0bits.P1STRC            // bit 2
#define P1STRD                  PSMC1STR0bits.P1STRD            // bit 3
#define P1STRE                  PSMC1STR0bits.P1STRE            // bit 4
#define P1STRF                  PSMC1STR0bits.P1STRF            // bit 5

#define P1HSMEN                 PSMC1STR1bits.P1HSMEN           // bit 0
#define P1LSMEN                 PSMC1STR1bits.P1LSMEN           // bit 1
#define P1SSYNC                 PSMC1STR1bits.P1SSYNC           // bit 7

#define P1SYNC0                 PSMC1SYNCbits.P1SYNC0           // bit 0
#define P1SYNC1                 PSMC1SYNCbits.P1SYNC1           // bit 1
#define P1SYNC2                 PSMC1SYNCbits.P1SYNC2           // bit 2
#define P1DCPOL                 PSMC1SYNCbits.P1DCPOL           // bit 5
#define P1PRPOL                 PSMC1SYNCbits.P1PRPOL           // bit 6
#define P1POFST                 PSMC1SYNCbits.P1POFST           // bit 7

#define PSMC1TMR8               PSMC1TMRHbits.PSMC1TMR8         // bit 0
#define PSMC1TMR9               PSMC1TMRHbits.PSMC1TMR9         // bit 1
#define PSMC1TMR10              PSMC1TMRHbits.PSMC1TMR10        // bit 2
#define PSMC1TMR11              PSMC1TMRHbits.PSMC1TMR11        // bit 3
#define PSMC1TMR12              PSMC1TMRHbits.PSMC1TMR12        // bit 4
#define PSMC1TMR13              PSMC1TMRHbits.PSMC1TMR13        // bit 5
#define PSMC1TMR14              PSMC1TMRHbits.PSMC1TMR14        // bit 6
#define PSMC1TMR15              PSMC1TMRHbits.PSMC1TMR15        // bit 7

