OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1789.h
#define PSMC3PR8                PSMC3PRHbits.PSMC3PR8           // bit 0
#define PSMC3PR9                PSMC3PRHbits.PSMC3PR9           // bit 1
#define PSMC3PR10               PSMC3PRHbits.PSMC3PR10          // bit 2
#define PSMC3PR11               PSMC3PRHbits.PSMC3PR11          // bit 3
#define PSMC3PR12               PSMC3PRHbits.PSMC3PR12          // bit 4
#define PSMC3PR13               PSMC3PRHbits.PSMC3PR13          // bit 5
#define PSMC3PR14               PSMC3PRHbits.PSMC3PR14          // bit 6
#define PSMC3PR15               PSMC3PRHbits.PSMC3PR15          // bit 7

#define PSMC3PR0                PSMC3PRLbits.PSMC3PR0           // bit 0
#define PSMC3PR1                PSMC3PRLbits.PSMC3PR1           // bit 1
#define PSMC3PR2                PSMC3PRLbits.PSMC3PR2           // bit 2
#define PSMC3PR3                PSMC3PRLbits.PSMC3PR3           // bit 3
#define PSMC3PR4                PSMC3PRLbits.PSMC3PR4           // bit 4
#define PSMC3PR5                PSMC3PRLbits.PSMC3PR5           // bit 5
#define PSMC3PR6                PSMC3PRLbits.PSMC3PR6           // bit 6
#define PSMC3PR7                PSMC3PRLbits.PSMC3PR7           // bit 7

#define P3PRST                  PSMC3PRSbits.P3PRST             // bit 0
#define P3PRSC1                 PSMC3PRSbits.P3PRSC1            // bit 1
#define P3PRSC2                 PSMC3PRSbits.P3PRSC2            // bit 2
#define P3PRSC3                 PSMC3PRSbits.P3PRSC3            // bit 3
#define P3PRSC4                 PSMC3PRSbits.P3PRSC4            // bit 4
#define P3PRSIN                 PSMC3PRSbits.P3PRSIN            // bit 7

#define P3REBSC1                PSMC3REBSbits.P3REBSC1          // bit 1
#define P3REBSC2                PSMC3REBSbits.P3REBSC2          // bit 2
#define P3REBSC3                PSMC3REBSbits.P3REBSC3          // bit 3
#define P3REBSC4                PSMC3REBSbits.P3REBSC4          // bit 4
#define P3REBSIN                PSMC3REBSbits.P3REBSIN          // bit 7

#define P3STRA                  PSMC3STR0bits.P3STRA            // bit 0
#define P3STRB                  PSMC3STR0bits.P3STRB            // bit 1
#define P3STRC                  PSMC3STR0bits.P3STRC            // bit 2
#define P3STRD                  PSMC3STR0bits.P3STRD            // bit 3
#define P3STRE                  PSMC3STR0bits.P3STRE            // bit 4
#define P3STRF                  PSMC3STR0bits.P3STRF            // bit 5

#define P3HSMEN                 PSMC3STR1bits.P3HSMEN           // bit 0
#define P3LSMEN                 PSMC3STR1bits.P3LSMEN           // bit 1
#define P3SSYNC                 PSMC3STR1bits.P3SSYNC           // bit 7

#define P3SYNC0                 PSMC3SYNCbits.P3SYNC0           // bit 0
#define P3SYNC1                 PSMC3SYNCbits.P3SYNC1           // bit 1
#define P3SYNC2                 PSMC3SYNCbits.P3SYNC2           // bit 2
#define P3DCPOL                 PSMC3SYNCbits.P3DCPOL           // bit 5
#define P3PRPOL                 PSMC3SYNCbits.P3PRPOL           // bit 6
#define P3POFST                 PSMC3SYNCbits.P3POFST           // bit 7

#define PSMC3TMR8               PSMC3TMRHbits.PSMC3TMR8         // bit 0
#define PSMC3TMR9               PSMC3TMRHbits.PSMC3TMR9         // bit 1
#define PSMC3TMR10              PSMC3TMRHbits.PSMC3TMR10        // bit 2
#define PSMC3TMR11              PSMC3TMRHbits.PSMC3TMR11        // bit 3
#define PSMC3TMR12              PSMC3TMRHbits.PSMC3TMR12        // bit 4
#define PSMC3TMR13              PSMC3TMRHbits.PSMC3TMR13        // bit 5
#define PSMC3TMR14              PSMC3TMRHbits.PSMC3TMR14        // bit 6
#define PSMC3TMR15              PSMC3TMRHbits.PSMC3TMR15        // bit 7

#define PSMC3TMR0               PSMC3TMRLbits.PSMC3TMR0         // bit 0
#define PSMC3TMR1               PSMC3TMRLbits.PSMC3TMR1         // bit 1
#define PSMC3TMR2               PSMC3TMRLbits.PSMC3TMR2         // bit 2
#define PSMC3TMR3               PSMC3TMRLbits.PSMC3TMR3         // bit 3
#define PSMC3TMR4               PSMC3TMRLbits.PSMC3TMR4         // bit 4
#define PSMC3TMR5               PSMC3TMRLbits.PSMC3TMR5         // bit 5
#define PSMC3TMR6               PSMC3TMRLbits.PSMC3TMR6         // bit 6
#define PSMC3TMR7               PSMC3TMRLbits.PSMC3TMR7         // bit 7

#define P4ASDOV                 PSMC4ASDCbits.P4ASDOV           // bit 0
#define P4ARSEN                 PSMC4ASDCbits.P4ARSEN           // bit 5
#define P4ASDEN                 PSMC4ASDCbits.P4ASDEN           // bit 6
#define P4ASE                   PSMC4ASDCbits.P4ASE             // bit 7

#define P4ASDLA                 PSMC4ASDLbits.P4ASDLA           // bit 0
#define P4ASDLB                 PSMC4ASDLbits.P4ASDLB           // bit 1

#define P4ASDSC1                PSMC4ASDSbits.P4ASDSC1          // bit 1
#define P4ASDSC2                PSMC4ASDSbits.P4ASDSC2          // bit 2
#define P4ASDSC3                PSMC4ASDSbits.P4ASDSC3          // bit 3
#define P4ASDSC4                PSMC4ASDSbits.P4ASDSC4          // bit 4
#define P4ASDSIN                PSMC4ASDSbits.P4ASDSIN          // bit 7

#define PSMC4BLKF0              PSMC4BLKFbits.PSMC4BLKF0        // bit 0
#define PSMC4BLKF1              PSMC4BLKFbits.PSMC4BLKF1        // bit 1
#define PSMC4BLKF2              PSMC4BLKFbits.PSMC4BLKF2        // bit 2
#define PSMC4BLKF3              PSMC4BLKFbits.PSMC4BLKF3        // bit 3
#define PSMC4BLKF4              PSMC4BLKFbits.PSMC4BLKF4        // bit 4
#define PSMC4BLKF5              PSMC4BLKFbits.PSMC4BLKF5        // bit 5
#define PSMC4BLKF6              PSMC4BLKFbits.PSMC4BLKF6        // bit 6
#define PSMC4BLKF7              PSMC4BLKFbits.PSMC4BLKF7        // bit 7

#define PSMC4BLKR0              PSMC4BLKRbits.PSMC4BLKR0        // bit 0
#define PSMC4BLKR1              PSMC4BLKRbits.PSMC4BLKR1        // bit 1
#define PSMC4BLKR2              PSMC4BLKRbits.PSMC4BLKR2        // bit 2
#define PSMC4BLKR3              PSMC4BLKRbits.PSMC4BLKR3        // bit 3
#define PSMC4BLKR4              PSMC4BLKRbits.PSMC4BLKR4        // bit 4
#define PSMC4BLKR5              PSMC4BLKRbits.PSMC4BLKR5        // bit 5
#define PSMC4BLKR6              PSMC4BLKRbits.PSMC4BLKR6        // bit 6
#define PSMC4BLKR7              PSMC4BLKRbits.PSMC4BLKR7        // bit 7

#define P4REBM0                 PSMC4BLNKbits.P4REBM0           // bit 0
#define P4REBM1                 PSMC4BLNKbits.P4REBM1           // bit 1
#define P4FEBM0                 PSMC4BLNKbits.P4FEBM0           // bit 4
#define P4FEBM1                 PSMC4BLNKbits.P4FEBM1           // bit 5

#define P4CSRC0                 PSMC4CLKbits.P4CSRC0            // bit 0
#define P4CSRC1                 PSMC4CLKbits.P4CSRC1            // bit 1
#define P4CPRE0                 PSMC4CLKbits.P4CPRE0            // bit 4
#define P4CPRE1                 PSMC4CLKbits.P4CPRE1            // bit 5

