OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1789.h
#define P4MODE0                 PSMC4CONbits.P4MODE0            // bit 0
#define P4MODE1                 PSMC4CONbits.P4MODE1            // bit 1
#define P4MODE2                 PSMC4CONbits.P4MODE2            // bit 2
#define P4MODE3                 PSMC4CONbits.P4MODE3            // bit 3
#define P4DBRE                  PSMC4CONbits.P4DBRE             // bit 4
#define P4DBFE                  PSMC4CONbits.P4DBFE             // bit 5
#define PSMC4LD                 PSMC4CONbits.PSMC4LD            // bit 6
#define PSMC4EN                 PSMC4CONbits.PSMC4EN            // bit 7

#define PSMC4DBF0               PSMC4DBFbits.PSMC4DBF0          // bit 0
#define PSMC4DBF1               PSMC4DBFbits.PSMC4DBF1          // bit 1
#define PSMC4DBF2               PSMC4DBFbits.PSMC4DBF2          // bit 2
#define PSMC4DBF3               PSMC4DBFbits.PSMC4DBF3          // bit 3
#define PSMC4DBF4               PSMC4DBFbits.PSMC4DBF4          // bit 4
#define PSMC4DBF5               PSMC4DBFbits.PSMC4DBF5          // bit 5
#define PSMC4DBF6               PSMC4DBFbits.PSMC4DBF6          // bit 6
#define PSMC4DBF7               PSMC4DBFbits.PSMC4DBF7          // bit 7

#define PSMC4DBR0               PSMC4DBRbits.PSMC4DBR0          // bit 0
#define PSMC4DBR1               PSMC4DBRbits.PSMC4DBR1          // bit 1
#define PSMC4DBR2               PSMC4DBRbits.PSMC4DBR2          // bit 2
#define PSMC4DBR3               PSMC4DBRbits.PSMC4DBR3          // bit 3
#define PSMC4DBR4               PSMC4DBRbits.PSMC4DBR4          // bit 4
#define PSMC4DBR5               PSMC4DBRbits.PSMC4DBR5          // bit 5
#define PSMC4DBR6               PSMC4DBRbits.PSMC4DBR6          // bit 6
#define PSMC4DBR7               PSMC4DBRbits.PSMC4DBR7          // bit 7

#define PSMC4DC8                PSMC4DCHbits.PSMC4DC8           // bit 0
#define PSMC4DC9                PSMC4DCHbits.PSMC4DC9           // bit 1
#define PSMC4DC10               PSMC4DCHbits.PSMC4DC10          // bit 2
#define PSMC4DC11               PSMC4DCHbits.PSMC4DC11          // bit 3
#define PSMC4DC12               PSMC4DCHbits.PSMC4DC12          // bit 4
#define PSMC4DC13               PSMC4DCHbits.PSMC4DC13          // bit 5
#define PSMC4DC14               PSMC4DCHbits.PSMC4DC14          // bit 6
#define PSMC4DC15               PSMC4DCHbits.PSMC4DC15          // bit 7

#define PSMC4DC0                PSMC4DCLbits.PSMC4DC0           // bit 0
#define PSMC4DC1                PSMC4DCLbits.PSMC4DC1           // bit 1
#define PSMC4DC2                PSMC4DCLbits.PSMC4DC2           // bit 2
#define PSMC4DC3                PSMC4DCLbits.PSMC4DC3           // bit 3
#define PSMC4DC4                PSMC4DCLbits.PSMC4DC4           // bit 4
#define PSMC4DC5                PSMC4DCLbits.PSMC4DC5           // bit 5
#define PSMC4DC6                PSMC4DCLbits.PSMC4DC6           // bit 6
#define PSMC4DC7                PSMC4DCLbits.PSMC4DC7           // bit 7

#define P4DCST                  PSMC4DCSbits.P4DCST             // bit 0
#define P4DCSC1                 PSMC4DCSbits.P4DCSC1            // bit 1
#define P4DCSC2                 PSMC4DCSbits.P4DCSC2            // bit 2
#define P4DCSC3                 PSMC4DCSbits.P4DCSC3            // bit 3
#define P4DCSC4                 PSMC4DCSbits.P4DCSC4            // bit 4
#define P4DCSIN                 PSMC4DCSbits.P4DCSIN            // bit 7

#define P4FEBSC1                PSMC4FEBSbits.P4FEBSC1          // bit 1
#define P4FEBSC2                PSMC4FEBSbits.P4FEBSC2          // bit 2
#define P4FEBSC3                PSMC4FEBSbits.P4FEBSC3          // bit 3
#define P4FEBSC4                PSMC4FEBSbits.P4FEBSC4          // bit 4
#define P4FEBSIN                PSMC4FEBSbits.P4FEBSIN          // bit 7

#define PSMC4FFA0               PSMC4FFAbits.PSMC4FFA0          // bit 0
#define PSMC4FFA1               PSMC4FFAbits.PSMC4FFA1          // bit 1
#define PSMC4FFA2               PSMC4FFAbits.PSMC4FFA2          // bit 2
#define PSMC4FFA3               PSMC4FFAbits.PSMC4FFA3          // bit 3

#define P4TPRIF                 PSMC4INTbits.P4TPRIF            // bit 0
#define P4TDCIF                 PSMC4INTbits.P4TDCIF            // bit 1
#define P4TPHIF                 PSMC4INTbits.P4TPHIF            // bit 2
#define P4TOVIF                 PSMC4INTbits.P4TOVIF            // bit 3
#define P4TPRIE                 PSMC4INTbits.P4TPRIE            // bit 4
#define P4TDCIE                 PSMC4INTbits.P4TDCIE            // bit 5
#define P4TPHIE                 PSMC4INTbits.P4TPHIE            // bit 6
#define P4TOVIE                 PSMC4INTbits.P4TOVIE            // bit 7

#define P4MSRC0                 PSMC4MDLbits.P4MSRC0            // bit 0
#define P4MSRC1                 PSMC4MDLbits.P4MSRC1            // bit 1
#define P4MSRC2                 PSMC4MDLbits.P4MSRC2            // bit 2
#define P4MSRC3                 PSMC4MDLbits.P4MSRC3            // bit 3
#define P4MDLBIT                PSMC4MDLbits.P4MDLBIT           // bit 5
#define P4MDLPOL                PSMC4MDLbits.P4MDLPOL           // bit 6
#define P4MDLEN                 PSMC4MDLbits.P4MDLEN            // bit 7

#define P4OEA                   PSMC4OENbits.P4OEA              // bit 0
#define P4OEB                   PSMC4OENbits.P4OEB              // bit 1

#define PSMC4PH8                PSMC4PHHbits.PSMC4PH8           // bit 0
#define PSMC4PH9                PSMC4PHHbits.PSMC4PH9           // bit 1
#define PSMC4PH10               PSMC4PHHbits.PSMC4PH10          // bit 2
#define PSMC4PH11               PSMC4PHHbits.PSMC4PH11          // bit 3
#define PSMC4PH12               PSMC4PHHbits.PSMC4PH12          // bit 4
#define PSMC4PH13               PSMC4PHHbits.PSMC4PH13          // bit 5
#define PSMC4PH14               PSMC4PHHbits.PSMC4PH14          // bit 6
#define PSMC4PH15               PSMC4PHHbits.PSMC4PH15          // bit 7

#define PSMC4PH0                PSMC4PHLbits.PSMC4PH0           // bit 0
#define PSMC4PH1                PSMC4PHLbits.PSMC4PH1           // bit 1
#define PSMC4PH2                PSMC4PHLbits.PSMC4PH2           // bit 2
#define PSMC4PH3                PSMC4PHLbits.PSMC4PH3           // bit 3
#define PSMC4PH4                PSMC4PHLbits.PSMC4PH4           // bit 4
#define PSMC4PH5                PSMC4PHLbits.PSMC4PH5           // bit 5
#define PSMC4PH6                PSMC4PHLbits.PSMC4PH6           // bit 6
#define PSMC4PH7                PSMC4PHLbits.PSMC4PH7           // bit 7

