OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1789.h
#define P4PHST                  PSMC4PHSbits.P4PHST             // bit 0
#define P4PHSC1                 PSMC4PHSbits.P4PHSC1            // bit 1
#define P4PHSC2                 PSMC4PHSbits.P4PHSC2            // bit 2
#define P4PHSC3                 PSMC4PHSbits.P4PHSC3            // bit 3
#define P4PHSC4                 PSMC4PHSbits.P4PHSC4            // bit 4
#define P4PHSIN                 PSMC4PHSbits.P4PHSIN            // bit 7

#define P4POLA                  PSMC4POLbits.P4POLA             // bit 0
#define P4POLB                  PSMC4POLbits.P4POLB             // bit 1
#define P4INPOL                 PSMC4POLbits.P4INPOL            // bit 6

#define PSMC4PR8                PSMC4PRHbits.PSMC4PR8           // bit 0
#define PSMC4PR9                PSMC4PRHbits.PSMC4PR9           // bit 1
#define PSMC4PR10               PSMC4PRHbits.PSMC4PR10          // bit 2
#define PSMC4PR11               PSMC4PRHbits.PSMC4PR11          // bit 3
#define PSMC4PR12               PSMC4PRHbits.PSMC4PR12          // bit 4
#define PSMC4PR13               PSMC4PRHbits.PSMC4PR13          // bit 5
#define PSMC4PR14               PSMC4PRHbits.PSMC4PR14          // bit 6
#define PSMC4PR15               PSMC4PRHbits.PSMC4PR15          // bit 7

#define PSMC4PR0                PSMC4PRLbits.PSMC4PR0           // bit 0
#define PSMC4PR1                PSMC4PRLbits.PSMC4PR1           // bit 1
#define PSMC4PR2                PSMC4PRLbits.PSMC4PR2           // bit 2
#define PSMC4PR3                PSMC4PRLbits.PSMC4PR3           // bit 3
#define PSMC4PR4                PSMC4PRLbits.PSMC4PR4           // bit 4
#define PSMC4PR5                PSMC4PRLbits.PSMC4PR5           // bit 5
#define PSMC4PR6                PSMC4PRLbits.PSMC4PR6           // bit 6
#define PSMC4PR7                PSMC4PRLbits.PSMC4PR7           // bit 7

#define P4PRST                  PSMC4PRSbits.P4PRST             // bit 0
#define P4PRSC1                 PSMC4PRSbits.P4PRSC1            // bit 1
#define P4PRSC2                 PSMC4PRSbits.P4PRSC2            // bit 2
#define P4PRSC3                 PSMC4PRSbits.P4PRSC3            // bit 3
#define P4PRSC4                 PSMC4PRSbits.P4PRSC4            // bit 4
#define P4PRSIN                 PSMC4PRSbits.P4PRSIN            // bit 7

#define P4REBSC1                PSMC4REBSbits.P4REBSC1          // bit 1
#define P4REBSC2                PSMC4REBSbits.P4REBSC2          // bit 2
#define P4REBSC3                PSMC4REBSbits.P4REBSC3          // bit 3
#define P4REBSC4                PSMC4REBSbits.P4REBSC4          // bit 4
#define P4REBSIN                PSMC4REBSbits.P4REBSIN          // bit 7

#define P4STRA                  PSMC4STR0bits.P4STRA            // bit 0
#define P4STRB                  PSMC4STR0bits.P4STRB            // bit 1

#define P4HSMEN                 PSMC4STR1bits.P4HSMEN           // bit 0
#define P4LSMEN                 PSMC4STR1bits.P4LSMEN           // bit 1
#define P4SSYNC                 PSMC4STR1bits.P4SSYNC           // bit 7

#define P4SYNC0                 PSMC4SYNCbits.P4SYNC0           // bit 0
#define P4SYNC1                 PSMC4SYNCbits.P4SYNC1           // bit 1
#define P4SYNC2                 PSMC4SYNCbits.P4SYNC2           // bit 2
#define P4DCPOL                 PSMC4SYNCbits.P4DCPOL           // bit 5
#define P4PRPOL                 PSMC4SYNCbits.P4PRPOL           // bit 6
#define P4POFST                 PSMC4SYNCbits.P4POFST           // bit 7

#define PSMC4TMR8               PSMC4TMRHbits.PSMC4TMR8         // bit 0
#define PSMC4TMR9               PSMC4TMRHbits.PSMC4TMR9         // bit 1
#define PSMC4TMR10              PSMC4TMRHbits.PSMC4TMR10        // bit 2
#define PSMC4TMR11              PSMC4TMRHbits.PSMC4TMR11        // bit 3
#define PSMC4TMR12              PSMC4TMRHbits.PSMC4TMR12        // bit 4
#define PSMC4TMR13              PSMC4TMRHbits.PSMC4TMR13        // bit 5
#define PSMC4TMR14              PSMC4TMRHbits.PSMC4TMR14        // bit 6
#define PSMC4TMR15              PSMC4TMRHbits.PSMC4TMR15        // bit 7

#define PSMC4TMR0               PSMC4TMRLbits.PSMC4TMR0         // bit 0
#define PSMC4TMR1               PSMC4TMRLbits.PSMC4TMR1         // bit 1
#define PSMC4TMR2               PSMC4TMRLbits.PSMC4TMR2         // bit 2
#define PSMC4TMR3               PSMC4TMRLbits.PSMC4TMR3         // bit 3
#define PSMC4TMR4               PSMC4TMRLbits.PSMC4TMR4         // bit 4
#define PSMC4TMR5               PSMC4TMRLbits.PSMC4TMR5         // bit 5
#define PSMC4TMR6               PSMC4TMRLbits.PSMC4TMR6         // bit 6
#define PSMC4TMR7               PSMC4TMRLbits.PSMC4TMR7         // bit 7

#define RX9D                    RC1STAbits.RX9D                 // bit 0
#define OERR                    RC1STAbits.OERR                 // bit 1
#define FERR                    RC1STAbits.FERR                 // bit 2
#define ADDEN                   RC1STAbits.ADDEN                // bit 3
#define CREN                    RC1STAbits.CREN                 // bit 4
#define SREN                    RC1STAbits.SREN                 // bit 5
#define RX9                     RC1STAbits.RX9                  // bit 6
#define SPEN                    RC1STAbits.SPEN                 // bit 7

#define SLRCONA0                SLRCONAbits.SLRCONA0            // bit 0
#define SLRCONA1                SLRCONAbits.SLRCONA1            // bit 1
#define SLRCONA2                SLRCONAbits.SLRCONA2            // bit 2
#define SLRCONA3                SLRCONAbits.SLRCONA3            // bit 3
#define SLRCONA4                SLRCONAbits.SLRCONA4            // bit 4
#define SLRCONA5                SLRCONAbits.SLRCONA5            // bit 5
#define SLRCONA6                SLRCONAbits.SLRCONA6            // bit 6
#define SLRCONA7                SLRCONAbits.SLRCONA7            // bit 7

#define SLRCONB0                SLRCONBbits.SLRCONB0            // bit 0
#define SLRCONB1                SLRCONBbits.SLRCONB1            // bit 1
#define SLRCONB2                SLRCONBbits.SLRCONB2            // bit 2
#define SLRCONB3                SLRCONBbits.SLRCONB3            // bit 3
#define SLRCONB4                SLRCONBbits.SLRCONB4            // bit 4
#define SLRCONB5                SLRCONBbits.SLRCONB5            // bit 5
#define SLRCONB6                SLRCONBbits.SLRCONB6            // bit 6
#define SLRCONB7                SLRCONBbits.SLRCONB7            // bit 7

#define SLRCONC0                SLRCONCbits.SLRCONC0            // bit 0
#define SLRCONC1                SLRCONCbits.SLRCONC1            // bit 1
#define SLRCONC2                SLRCONCbits.SLRCONC2            // bit 2
#define SLRCONC3                SLRCONCbits.SLRCONC3            // bit 3
#define SLRCONC4                SLRCONCbits.SLRCONC4            // bit 4
#define SLRCONC5                SLRCONCbits.SLRCONC5            // bit 5
#define SLRCONC6                SLRCONCbits.SLRCONC6            // bit 6
#define SLRCONC7                SLRCONCbits.SLRCONC7            // bit 7

